t21/Walnut_X/Packages/.cache/Keil.Kinetis_KVxx_DFP.1.6.0.pdsc
    <!-- Startup KV46F16 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV46F16 CMSIS">
      <description>System Startup for Kinetis KV46 168MHz devices devices devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKV46F16.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKV46F16.c"      attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKV46F16.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KV56F22 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV56F22 CMSIS">
      <description>System Startup for Kinetis KV56 220MHz devices devices devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKV56F24.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKV56F24.c"      attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKV56F24.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KV58F22 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV58F22 CMSIS">
      <description>System Startup for Kinetis KV58 220MHz devices devices devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/Source/ARM/startup_MKV58F24.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKV58F24.c"      attr="config" version="1.0.0"/>
        <file category="header" name="Device/Source/system_MKV58F24.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <bundle Cbundle="TWR-KV11Z75M" Cclass="Board Support" Cversion="1.0.0">
      <description>TWR-KV11Z75M Board Support</description>
      <doc></doc>
      <component Cgroup="Buttons" Capiversion="1.00" condition="MKV11Z7 CMSIS">
      <description>Button driver for Freescale TWR-KV11Z75M board</description>
        <files>
          <file category="source" name="Boards/Freescale/TWR-KV11Z75M/Common/Buttons_TWR-KV11Z75M.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="MKV11Z7 CMSIS">
      <description>LED driver for Freescale TWR-KV11Z75M board</description>
        <files>
          <file category="source" name="Boards/Freescale/TWR-KV11Z75M/Common/LED_TWR-KV11Z75M.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="TWR-KV46F150M" Cclass="Board Support" Cversion="1.0.0">
      <description>TWR-KV46F150M Board Support</description>
      <doc></doc>
      <component Cgroup="Buttons" Capiversion="1.00" condition="KV46F16 CMSIS">
      <description>Button driver for Freescale TWR-KV46F150M board</description>
        <files>
          <file category="source" name="Boards/Freescale/TWR-KV46F150M/Common/Buttons_TWR-KV46F150M.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="KV46F16 CMSIS">
      <description>LED driver for Freescale TWR-KV11Z75M board</description>
        <files>
          <file category="source" name="Boards/Freescale/TWR-KV46F150M/Common/LED_TWR-KV46F150M.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board name="TWR-KV10Z32" vendor="Freescale" revision="Rev. A" orderForm="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-KV10Z32" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-KV10Z32 is a development tool for the Kinetis V series KV1x family built on the ARM® Cortex™-M0+ processor.</description>
      <image small="Boards/Freescale/TWR-KV10Z32/Documents/TWR-KV10Z32_small.jpg"/>
      <book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-KV10Z32" title="TWR-KV10Z32 Web Page"/>
      <book category="setup"     name="Boards/Freescale/TWR-KV10Z32/Documents/MKV10Z32QSG.pdf"     title="Quick Start Guide"/>
      <book category="schematic" name="Boards/Freescale/TWR-KV10Z32/Documents/TWR-KV10Z32_SCH.pdf" title="Schematics"/>
      <book category="manual"    name="Boards/Freescale/TWR-KV10Z32/Documents/TWRKV10Z32UG.pdf"    title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKV10Z32xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" DsubFamily="KV10"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="ConnOther" n="2"              name="Motor Control Auxiliary Connector"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Button"    n="2"/>
      <feature type="Accelerometer" n="1"          name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"       n="8"              name="Eight user-controlled LEDs with connected buffers to PWM channels for dimming"/>
      <debugInterface adapter="JTAG/SW"   connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="CMSIS-DAP" connector="USB Mini-B"/>
      <feature type="TowerFF"   n="1"/>
    </board>

    <board name="TWR-KV11Z75M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>TWR-KV11Z75M: Kinetis V Series Tower System Module.</description>
      <image small="Boards/Freescale/TWR-KV11Z75M/Documents/TWR-KV11Z75M_small.jpg"
             large="Boards/Freescale/TWR-KV11Z75M/Documents/TWR-KV11Z75M_large.jpg"/>
      <book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-KV11Z75M"  title="TWR-KV11Z75M: Kinetis V Series Tower System Module"/>
      <book category="setup"     name="Boards/Freescale/TWR-KV11Z75M/Documents/TWRKV11Z75MQSG.pdf"   title="Quick Start Guide"/>
      <book category="schematic" name="Boards/Freescale/TWR-KV11Z75M/Documents/TWR-KV11Z75M-SCH.pdf" title="Schematics"/>
      <book category="manual"    name="Boards/Freescale/TWR-KV11Z75M/Documents/TWRKV11Z75MUG.pdf"    title="TWR-KV11Z75M Tower Module User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKV11Z128xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" DsubFamily="KV10"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="ConnOther" n="2"              name="Motor Control Auxiliary Connector"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Button"    n="2"/>
      <feature type="Accelerometer" n="1"          name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"       n="8"              name="Eight user-controlled LEDs with connected buffers to PWM channels for dimming"/>
      <debugInterface adapter="JTAG/SW"   connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="CMSIS-DAP" connector="USB Mini-B"/>
      <feature type="TowerFF"   n="1"/>
    </board>

    <board name="TWR-KV46F150M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-KV46F150M is a development tool for the 168 MHz KV4x families of Kinetis microcontrollers.</description>
      <image small="Boards/Freescale/TWR-KV46F150M/Documents/TWR-KV46F150M_small.jpg"
             large="Boards/Freescale/TWR-KV46F150M/Documents/TWR-KV46F150M_large.jpg"/>
      <book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-KV46F150M"  title="TWR-KV46F150M: Kinetis KV4x Family Tower System Module"/>
      <book category="setup"     name="Boards/Freescale/TWR-KV46F150M/Documents/TWR-KV46F150MQSG.pdf" title="TWR-KV46F150M Quick Start Guide for Motor Control"/>
      <book category="schematic" name="Boards/Freescale/TWR-KV46F150M/Documents/TWRKV46F150M_SCH.pdf" title="TWR-KV46F150M Schematics"/>
      <book category="manual"    name="Boards/Freescale/TWR-KV46F150M/Documents/TWRKV46F150MUG.pdf"   title="TWR-KV46F150M Tower Module User's Guide"/>
      <mountedDevice     deviceIndex="0" Dvendor="Freescale:78" Dname="MKV46F256xxx16"/>
      <compatibleDevice  deviceIndex="0" Dvendor="Freescale:78" Dfamily="KVxx Series"/>
      <feature type="ODbg"      n="1"              name="OpenSDA debug circuit with Mini USB connector and virtual serial port"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="ConnOther" n="2"              name="Motor Control Auxiliary Connector"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Button"    n="2"/>
      <feature type="LED"       n="9"              name="Eight user-controlled LEDs with connected buffers to PWM channels for dimming"/>
      <feature type="CAN"       n="1"              name="FlexCAN interface"/>
      <feature type="TempSens"  n="4"              name="Thermistors"/>
      <debugInterface adapter="JTAG/SW"   connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="CMSIS-DAP" connector="USB Mini-B"/>
      <feature type="TowerFF"   n="1"/>
    </board>
  </boards>

  <examples>
    <!-- TWR-KV10Z32 Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Freescale/TWR-KV10Z32/Blinky">
      <description>Blinky example</description>
      <board name="TWR-KV10Z32" vendor="Freescale" Dvendor="Freescale:78" Dname="MKV10Z32xxx7"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Freescale/TWR-KV10Z32/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KV10Z32" vendor="Freescale" Dvendor="Freescale:78" Dname="MKV10Z32xxx7"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KV11Z75M Tower Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Freescale/TWR-KV11Z75M/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KV11Z75M" vendor="Freescale" Dvendor="Freescale:78" Dname="MKV11Z128xxx7"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KV46F150M Development Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Freescale/TWR-KV46F150M/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KV46F150M" vendor="Freescale" Dvendor="Freescale:78" Dname="MKV46F256xxx16"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
